{
  "headers": {
    "experience": "Опыт",
    "skills": "Навыки",
    "qualities": "Личные качества",
    "goal": "Цель",
    "interests": "Интересы",
    "portfolio": "Примеры работ"
  },
  "descriptions": {
    "goal": "Стать одним из основных Full-stack разработчиков перспективной международной компании, в которой смогу реализовать свой потенциал. В перспективе получение опыта работы на Backend стороне, а также разработки мобильных приложений. Хотелось бы поучаствовать в проектах со сложными логическими процессами и применением искусственного интеллекта.",
    "interests": "В моей жизни много увлечений, которые позволяют мне не сойти с ума, хорошо провести свободное время и самосовершенствоваться...",
    "portfolio": "",
    "experience": "",
    "skills": "",
    "qualities": ""
  },
  "experience": {
    "1984": {
      "title": "Год рождения",
      "description": "Родился, проживаю и работаю в Харькове"
    },
    "2001": {
      "title": "Окончил лицей",
      "description": "Окончил Харьковский Экономический Лицей №161"
    },
    "2005": {
      "title": "Техник частной локальной сети",
      "description": "Подключение пользователей, расширение покрытия ЛВС, переоборудование, настройка оборудования"
    },
    "2007": {
      "title": "Окончил университет",
      "description": "Окончил Харьковский Национальный Экономический Университет (ХНЭУ) с отличием. Диплом - разработка автоматизированного модуля 'Мониторинг расчетов за предоставленные информационные услуги локальной сети' - отлично (10)"
    },
    "2008": {
      "title": "Техник-администратор Airbites",
      "description": "Настройка сетевого оборудования, пользовательских компьютеров, прокладка новых и обслуживание существующих линий ЛВС"
    },
    "2010": {
      "title": "Копирайтер/SEO оптимизатор/Контент-менеджер",
      "description": "Фрилансер - написание статей, оптимизация сайта для продвижения в поисковиках, добавление контента на сайт через админку и напрямую в код"
    },
    "2015": {
      "title": "HTML/CSS верстальщик",
      "description": "Фрилансер - верстка веб-страниц, адаптация CMS шаблонов под макет заказчика, исправление ошибок кроссбраузерности, доработка и корректировка дизайна"
    },
    "2016": {
      "title": "Трейни frontend разработчик Webiart",
      "description": "Прошел 3-месячный оплачиваемый тренинг веб-школы Demiart, в течение которого создал 4 одностраничных успешно реализованных сайта"
    },
    "2017": {
      "title": "Frontend разработчик BigDrop",
      "description": "Работал frontend разработчиком в компании BigDrop. В обязанности входило - frontend многостраничных сайтов и интернет-магазинов по уникальному дизайну для интеграции с Wordpress"
    },
    "2018": {
      "title": "React/Angular разработчик DigitalSuits",
      "description": "Разработка web приложений на React/Angular под кастомную API, помощь в разработке и модернизации существующих API"
    },
    "2019": {
      "title": "В настоящий момент...",
      "description": "В поиске успешной и перспективной компании, где смогу реализоваться как Angular full-stack разработчик..."
    }
  },
  "skills": {
    "main-stack": "Основной стек технологий:",
    "commercial": "Есть коммерческий опыт в:",
    "familiar": "Знаком с:",
    "desire": "Хотел быть освоить:",
    "filters": {
      "show": "по умолчанию",
      "level": "владение",
      "title": "алфавит"
    }
  },
  "portfolio": {
    "html": {
      "title": "HTML Handbook on React",
      "short": "React ES6 application",
      "description": "Interactive handbook of HTML tags on React/Redux technology. Filters, search, moveable mtitleu with tag pointer. Project was developing during 5 days on the bundler create-react-app."
    },
    "magnat-lzr":{
      "title": "Headphones Magnat LZR",
      "short": "",
      "description": ""
    },
    "pizza":{
      "title": "Application 'Pizzeria'",
      "short": "Landing page on Angular 2 ES6",
      "description": "Educational project on Angular2 (angular-cli). On the website implemented online store of pizzas, compiling from ingredients and adding to basket. All data saving in localStorage."
    },
    "resume":{
      "title": "Interactive Resume",
      "short": "Application on React",
      "description": "Application on Angular with language changing feature, viewing work from portfolio on different resolutions. Work created on Webpack bundler, responsive design."
    },
    "value":{
      "title": "Value Garden Supply'",
      "short": "Pixel Perfect Page",
      "description": "Crossbrowser markup of webpage by JPG layout. Responsive on my own opinion."
    },
    "naturetour":{
      "title": "Nature Tour'",
      "short": "Pixel Perfect Page",
      "description": "Crossbrowser markup of webpage by PSD layout with implementation of slider on JavaScript. Responsive on my own opinion. Preprocessor LESS used."
    },
    "jokerbros":{
      "title": "Game Room'",
      "short": "Educational project from scratch",
      "description": "Project on DB MySQL randomly choose winner from visitors, who get all bits of participants of the game. DB filters of game rooms, debit of losers and adding of new game rooms."
    },
    "weather":{
      "title": "Weather forecast from Yahoo",
      "short": "Application on React",
      "description": "Application 'Yahoo weather forecast' of all cities of the world. Used Yahoo Weather Api and different React plugins. Forecast on a week with graph of temperatures."
    },
    "shoop":{
      "title": "Online store",
      "short": "",
      "description": ""
    },
    "neews":{
      "title": "News portal",
      "short": "",
      "description": ""
    },
    "mmedia":{
      "title": "Website of video studio",
      "short": "",
      "description": ""
    },
    "icharger":{
      "title": "Landing page iCharger",
      "short": "",
      "description": ""
    },
    "seo20min":{
      "title": "SEO for 20 minutes",
      "short": "",
      "description": ""
    },
    "cloudsnews":{
      "title": "SEO for 20 minutes",
      "short": "",
      "description": ""
    },
    "po-sekretu":{
      "title": "Blog 'Po sekretu'",
      "short": "",
      "description": ""
    },
    "paladium":{
      "title": "LP of repairing company",
      "short": "",
      "description": ""
    },
    "jobshouse":{
      "title": "Web business card",
      "short": "",
      "description": ""
    }
  },
  "interests": {
    "code": "В настоящее время моё главное увлечение – это кодить",
    "book": "В свободное время могу прочитать одну-две книги известных авторов",
    "music": "Музыка - незаменимый спутник. В моем mp3 плеере вседа найдется нужный трек",
    "games": "Такие игры как УНО, Алиас, Монополия, Мафия - это отличный повод встретиться с друзьями и повеселиться",
    "bike": "Велосипед для меня это способ активно провести досуг, особенно в компании с друзьями на длинных поездках",
    "snowboard": "Сноуборд – мое экстремальное увлечение №1. Жаль только зима не круглый год",
    "windsurf": "Виндсерф – это увлечение юности, а также один из видов спорта, в котором я преуспел",
    "kite": "Кайт – это свобода на морских волнах. Во время поездки на море обязательно выхожу в море с кайтом",
    "tennis": "Теннис – увлечение детства, переросшее в нечто большее. Перед университетом был КМС-ом, сегодня просто любитель",
    "smoke": "Не курю, что также помогает мне чувствовать себя хорошо",
    "alcohol": "Алкоголь не употребляю",
    "drug": "Не употребляю никакие наркотики",
    "cgames": "Стараюсь не тратить свое свободное время на компьютерные игры",
    "angry": "Не склонен к недовольству, ворчливости и агрессии"
  },
  "qualities": {
    "fast-start": {
      "title": "Быстрый старт",
      "description": "Вникаю в проект в течение 1-2 дней, умею быстро настроить свое окружение для начала работы, также могу освоить новую технологию довольно быстро"
    },
    "team-player": {
      "title": "Командный игрок",
      "description": "Неоднократно встречал полное взаимопонимание со стороны участников проекта, с которыми мне приходилось работать. Никогда не конфликтую с коллегами, а наоборот стараюсь поддержать позитивную атмосферу"
    },
    "clear-code": {
      "title": "Чистый код",
      "description": "В результате рефакторинга большого количества кода понял, что код нужно писать чистым и понятным для других разработчиков - поэтому в моей работе стараюсь придерживаться этого правила и совершенствоваться в этом направлении"
    },
    "diligent": {
      "title": "Добросовестность",
      "description": "Честность и добросовестность - это качества, которым придерживаюсь в любой ситуации."
    },
    "energetic": {
      "title": "Энергичность",
      "description": "Все мои коллеги на прошлых местах работы были рады работать со мной в одном проекте благодаря моей энергичности и позитиву. Это качество также позволяет мне быстро справляться со своей работой"
    },
    "communicate": {
      "title": "Коммуникабельность",
      "description": "Умение общаться с людьми - это один жизненно важный навык для программиста, поэтому я не упускаю возможности пообщаться с коллегами, как по работе, так и вне её"
    },
    "quick-learn": {
      "title": "Быстрая обучаемость",
      "description": "Быстро осваиваю новую информацию и умею в кратчайшие сроки начать пользоваться незнакомым плагином или технологией"
    },
    "productivity": {
      "title": "Продуктивность",
      "description": "На прошлых работах меня ценили за быстровыполненную работу"
    }
  }
}