{
  "name": "Демиденко Денис - Angular/React frontend разработчик",
  "menu": {
    "djinni": "Перейти на аккаунт Djinni",
    "github": "Перейти на репозиторий Github",
    "linkedin": "Перейти на аккаунт LinkedIn",
    "diplom": "Показать диплом",
    "review": "Показать рецензию к диплому",
    "grades": "Показать оценки",
    "pdf": "Скачать PDF версию резюме",
    "doc": "Скачать DOC версию резюме",
    "print": "Распечатать резюме",
    "ru": "Переключить на русский язык",
    "ua": "Переключить на украинский язык",
    "en": "Переключить на английский язык",
    "iphone": "Открыть в iPhone 5",
    "samsung": "Открыть в Samsung Galaxy S7",
    "ipad": "Открыть в iPad Classic",
    "ipadpro": "Открыть в iPad Pro",
    "laptop": "Открыть в окне Laptop",
    "desktop": "Открыть в окне Desktop Monitor"
  },
  "headers": {
    "experience": "Опыт",
    "skills": "Навыки",
    "qualities": "Личные качества",
    "goal": "Цель",
    "interests": "Интересы",
    "portfolio": "Примеры работ"
  },
  "descriptions": {
    "goal": "Стать одним из основных Full-stack разработчиков перспективной международной компании, в которой смогу реализовать свой потенциал. В перспективе получение опыта работы на Backend стороне, а также разработки мобильных приложений. Хотелось бы поучаствовать в проектах со сложными логическими процессами и применением искусственного интеллекта.",
    "interests": "В моей жизни много увлечений, которые позволяют мне не сойти с ума, хорошо провести свободное время и самосовершенствоваться...",
    "portfolio": "",
    "experience": "",
    "skills": "",
    "qualities": ""
  },
  "experience": {
    "1984": {
      "title": "Год рождения",
      "description": "Родился, проживаю и работаю в Харькове"
    },
    "2001": {
      "title": "Окончил лицей",
      "description": "Окончил Харьковский Экономический Лицей №161"
    },
    "2005": {
      "title": "Техник частной локальной сети",
      "description": "Подключение пользователей, расширение покрытия ЛВС, переоборудование, настройка оборудования"
    },
    "2007": {
      "title": "Окончил университет",
      "description": "Окончил Харьковский Национальный Экономический Университет (ХНЭУ) с отличием. Диплом - разработка автоматизированного модуля 'Мониторинг расчетов за предоставленные информационные услуги локальной сети' - отлично (10)"
    },
    "2008": {
      "title": "Техник-администратор Airbites",
      "description": "Настройка сетевого оборудования, пользовательских компьютеров, прокладка новых и обслуживание существующих линий ЛВС"
    },
    "2010": {
      "title": "Копирайтер/SEO оптимизатор/Контент-менеджер",
      "description": "Фрилансер - написание статей, оптимизация сайта для продвижения в поисковиках, добавление контента на сайт через админку и напрямую в код"
    },
    "2015": {
      "title": "HTML/CSS верстальщик",
      "description": "Фрилансер - верстка веб-страниц, адаптация CMS шаблонов под макет заказчика, исправление ошибок кроссбраузерности, доработка и корректировка дизайна"
    },
    "2016": {
      "title": "Трейни frontend разработчик",
      "description": "Прошел 3-месячный оплачиваемый тренинг веб-школы Demiart, в течение которого создал 4 одностраничных успешно реализованных сайта"
    },
    "2017": {
      "title": "Frontend разработчик",
      "description": "Работал в компании BigDrop в течение года. В обязанности входило - frontend многостраничных сайтов и интернет-магазинов по уникальному дизайну для интеграции с Wordpress"
    },
    "2018": {
      "title": "React/Angular разработчик",
      "description": "Разработка web приложений на React/Angular под кастомную API, помощь в разработке и модернизации существующих API в компании DigitalSuits - 6 мес. и частной команды фрилансеров - 4 мес."
    },
    "2019": {
      "title": "В настоящий момент...",
      "description": "В поиске успешной и перспективной компании, где смогу реализоваться как Angular full-stack разработчик..."
    }
  },
  "skills": {
    "main-stack": "Основной стек технологий:",
    "commercial": "Есть коммерческий опыт в:",
    "familiar": "Знаком с:",
    "desire": "Хотел быть освоить:",
    "filters": {
      "show": "по умолчанию",
      "level": "владение",
      "title": "алфавит"
    }
  },
  "portfolio": {
    "html": {
      "title": "Справочник HTML на React",
      "short": "Приложение на React",
      "description": "Интерактивная справка HTML тегов на React/Redux. Фильтрация, поиск, движущиеся меню с указателем. Проект готовился 5 дней с использованием платформы create-react-app."
    },
    "magnat-lzr":{
      "title": "Магазин наушников Magnat",
      "short": "Одностраничный сайт с нуля",
      "description": "Кастомный HTML5 Video плеер на главной, адаптивный дизайн с поддержкой на мобильных устройствах. Модульная структура JS скрипта."
    },
    "pizza":{
      "title": "Приложение 'Пиццерия'",
      "short": "Одностраничник на Angular 2",
      "description": "Учебный проект на Angular2 (angular-cli). На сайте реализован онлайн-магазин пиццы, сбор из ингредиентов и добавление в корзину. Все данные хранятся в localStorage."
    },
    "resume":{
      "title": "Интерактивное резюме",
      "short": "Одностраничное резюме на Angular",
      "description": "Приложение на Angular с интернационализацией, просмотром работы из портфолио в разных устройствах. Работа выполнена на сборке Webpack, с получением данных из Firebase, адаптивная верстка."
    },
    "value":{
      "title": "Value Garden Supply",
      "short": "Страница пиксель в пиксель",
      "description": "Кроссбраузерная верстка страницы по JPG макету. Реализация адаптивности на мое усмотрение."
    },
    "naturetour":{
      "title": "Nature Tour",
      "short": "Страница пиксель в пиксель",
      "description": "Кроссбраузерная верстка страницы по PSD макету с реализацией динамичного слайдера на JavaScript. Адаптивность на мое усмотрение. Препроцессор LESS."
    },
    "jokerbros":{
      "title": "Игровой шоурум Jokerbros",
      "short": "Учебный проект с нуля",
      "description": "Проект с БД случайным образом выбирает игрока-победителя, которому начисляется ставка всех участников игры. БД фильтры игровых столов, списание средств с проигравших и добавление геймрума."
    },
    "weather":{
      "title": "Прогноз погоды от Yahoo",
      "short": "Учебное приложение на React",
      "description": "Приложение для просмотра прогноза погоды по городам мира. Использовалась Yahoo Weather Api, а также различные плагины React. Отображение прогноза погоды на неделю для каждого города."
    },
    "shoop":{
      "title": "Онлайн магазин",
      "short": "Дипломный проект на заказ",
      "description": "Проект интернет магазина с самописной CMS. Категории, товары, добавление в корзину, изменение кол-ва товаров в корзине, авторизация. Есть админ-панель для управления товарами и категориями."
    },
    "neews":{
      "title": "Новостной портал",
      "short": "Учебный проект с нуля",
      "description": "Новостной портал реализован на PHP и БД MySQL. Разбивка новостей по категориям, дням и журналам. Добавление статей через админку, права пользователя на добавление и публикацию."
    },
    "mmedia":{
      "title": "Вебсайт видеостудии",
      "short": "Сайт на шаблоне HTML5/JS",
      "description": "Адаптация HTML5 шаблона под нужды компании по производству видео рекламы. Внедрение видеофона, изменение скрипта, добавление возможности размещения видео с Youtube."
    },
    "icharger":{
      "title": "Одностраничник iCharger",
      "short": "Одностраничный сайт за день",
      "description": "Верстка одностраничного сайта с нуля за день. Требования – минимальный функционал, максимальная скорость. Подключение партнерки и плагина прокрутки."
    },
    "seo20min":{
      "title": "SEO за 20 минут",
      "short": "Страница пиксель в пиксель",
      "description": "Тренировочный проект. Кроссбраузерная верстка страницы 'пиксель в пиксель' по JPG макету."
    },
    "cloudnews":{
      "title": "Cloudnews",
      "short": "Страница пиксель в пиксель",
      "description": "Страница новостного портала по PSD макету с реализацией дизайна пиксель в пиксель. Использование SASS и дополнений к Chrome - 'PerfectPixel' и 'Pix to Pix'"
    },
    "po-sekretu":{
      "title": "Блог 'По секрету'",
      "short": "Сайт на Wordpress",
      "description": "Адаптация Wordpress шаблона под блог заказчика. Наращивание функционала с помощью плагинов, изменение дизайна, добавление возможностей через изменение PHP скриптов. Размещение и поддержка сайта."
    }
  },
  "interests": {
    "code": "В настоящее время моё главное увлечение – это кодить",
    "book": "В свободное время могу прочитать одну-две книги известных авторов",
    "music": "Музыка - незаменимый спутник. В моем mp3 плеере вседа найдется нужный трек",
    "games": "Такие игры как УНО, Алиас, Монополия, Мафия - это отличный повод встретиться с друзьями и повеселиться",
    "bike": "Велосипед для меня это способ активно провести досуг, особенно в компании с друзьями на длинных поездках",
    "snowboard": "Сноуборд – мое экстремальное увлечение №1. Жаль только зима не круглый год",
    "windsurf": "Виндсерф – это увлечение юности, а также один из видов спорта, в котором я преуспел",
    "kite": "Кайт – это свобода на морских волнах. Во время поездки на море обязательно выхожу в море с кайтом",
    "tennis": "Теннис – увлечение детства, переросшее в нечто большее. Перед университетом был КМС-ом, сегодня просто любитель",
    "smoke": "Не курю, что также помогает мне чувствовать себя хорошо",
    "alcohol": "Алкоголь не употребляю",
    "drug": "Не употребляю никакие наркотики",
    "cgames": "Стараюсь не тратить свое свободное время на компьютерные игры",
    "angry": "Не склонен к недовольству, ворчливости и агрессии"
  },
  "qualities": {
    "fast-start": {
      "title": "Быстрый старт",
      "description": "Вникаю в проект в течение 1-2 дней, умею быстро настроить свое окружение для начала работы, также могу освоить новую технологию довольно быстро"
    },
    "team-player": {
      "title": "Командный игрок",
      "description": "Неоднократно встречал полное взаимопонимание со стороны участников проекта, с которыми мне приходилось работать. Никогда не конфликтую с коллегами, а наоборот стараюсь поддержать позитивную атмосферу"
    },
    "clear-code": {
      "title": "Чистый код",
      "description": "В результате рефакторинга большого количества кода понял, что код нужно писать чистым и понятным для других разработчиков - поэтому в моей работе стараюсь придерживаться этого правила и совершенствоваться в этом направлении"
    },
    "diligent": {
      "title": "Добросовестность",
      "description": "Честность и добросовестность - это качества, которым придерживаюсь в любой ситуации."
    },
    "energetic": {
      "title": "Энергичность",
      "description": "Все мои коллеги на прошлых местах работы были рады работать со мной в одном проекте благодаря моей энергичности и позитиву. Это качество также позволяет мне быстро справляться со своей работой"
    },
    "communicate": {
      "title": "Коммуникабельность",
      "description": "Умение общаться с людьми - это один жизненно важный навык для программиста, поэтому я не упускаю возможности пообщаться с коллегами, как по работе, так и вне её"
    },
    "quick-learn": {
      "title": "Быстрая обучаемость",
      "description": "Быстро осваиваю новую информацию и умею в кратчайшие сроки начать пользоваться незнакомым плагином или технологией"
    },
    "productivity": {
      "title": "Продуктивность",
      "description": "На прошлых работах меня ценили за быстровыполненную работу"
    }
  },
  "service": {
    "back-to-portfolio": "Вернуться к списку работ",
    "go-to-work-site": "Перейти на сайт",
    "filter-tip": "Показать работы с применением ",
    "layout": "Посмотреть макет"
  }
}