{
  "name": "Демиденко Денис - Angular/React frontend розробник",
  "menu": {
    "djinni": "Перейти до аккаунту Djinni",
    "github": "Перейти до репозиторія Github",
    "linkedin": "Перейти до аккаунту LinkedIn",
    "diplom": "Показати диплом",
    "review": "Показати рецензію до диплому",
    "grades": "Показати оцінки",
    "pdf": "Завантажити PDF версію резюме",
    "doc": "Завантажити DOC версію резюме",
    "print": "Роздрукувати резюме",
    "ru": "Переключити на російську мову",
    "ua": "Переключити на українську мову",
    "en": "Переключити на англійську мову",
    "iphone": "Відкрити в iPhone 5",
    "samsung": "Відкрити в Samsung Galaxy S7",
    "ipad": "Відкрити в iPad Classic",
    "ipadpro": "Відкрити в iPad Pro",
    "laptop": "Відкрити в окне Laptop",
    "desktop": "Відкрити в окне Desktop Monitor"
  },
  "headers": {
    "experience": "Досвіт",
    "skills": "Навички",
    "qualities": "Особисті якості",
    "goal": "Мета",
    "interests": "Захоплення",
    "portfolio": "Приклади робот"
  },
  "descriptions": {
    "goal": "Стати одним з основних Full-stack розробників перспективної міжнародної компанії, в якій зможу реалізувати свій потенціал. У перспективі отримання досвіду роботи на Backend стороні, а також розробки мобільних додатків. Хотілося б взяти участь в проектах зі складними логічними процесами і застосуванням штучного інтелекту.",
    "interests": "У моєму житті багато захоплень, які дозволяють мені не з'їхати з глузду, добре провести вільний час і самовдосконалюватися...",
    "portfolio": "",
    "experience": "",
    "skills": "",
    "qualities": ""
  },
  "experience": {
    "1984": {
      "title": "Рік нарождення",
      "description": "Народився, мешкаю та працюю в Харкові"
    },
    "2001": {
      "title": "Закінчив ліцей",
      "description": "Закінчив Харківський Економічний Ліцей №161"
    },
    "2005": {
      "title": "Технік приватної локальной мережі",
      "description": "Підключення користувачів, розширення покриття ЛРМ, переобладнання, налаштування обладнанная"
    },
    "2007": {
      "title": "Закінчив університет",
      "description": "Закінчив Харківський Національний Економічний Університет (ХНЕУ) на відміну. Диплом - розробка автоматизованого модулю 'Моніторинг розрахунків за надані інформаційні послуги локальної мережі' - відмінно (10)"
    },
    "2008": {
      "title": "Технік-адміністратор Airbites",
      "description": "Налаштування мережевого обладнання, користувальницьких компьютерів, проведення нових та обслуговування існуючих ліній ЛРМ"
    },
    "2010": {
      "title": "Копірайтер/SEO оптимізатор/Контент-менеджер",
      "description": "Фрилансер - написання статей, оптимізація сайтів для просування у пошуковиках, додання контенту на сайти через адмінки та безпосередньо в код"
    },
    "2015": {
      "title": "HTML/CSS верстальщик",
      "description": "Фрилансер - верстка веб-сторінок, адаптація CMS шаблонів під макет замовника, виправлення помилок кроссбраузерності, створення дизайну"
    },
    "2016": {
      "title": "Трейні frontend розробник",
      "description": "Пройшов 3-місячний оплачуваний тренінг веб-школи Demiart, протягом якого створив 4 односторінкових успішно реалізованих сайта"
    },
    "2017": {
      "title": "Frontend розробник BigDrop",
      "description": "Працював в компанії BigDrop на протязі року. В обов'язки входило - frontend багатосторінкович сайтів та інтернет-магазинів за уникальним дизайном для интеграції з Wordpress"
    },
    "2018": {
      "title": "Angular/React розробник DigitalSuits",
      "description": "Розробка web додатків на React/Angular під кастомну API, допомога в розробці та модернизації існуючих API"
    },
    "2019": {
      "title": "В даний час...",
      "description": "У пошуку успішної і перспективної компанії, де зможу реалізуватися як Angular full-stack розробник..."
    }
  },
  "skills": {
    "main-stack": "Основний стек технологій:",
    "commercial": "Є комерційний досвід у:",
    "familiar": "Знайомий з:",
    "desire": "Бажаю освоїти:",
    "filters": {
      "show": "за замовчуванням",
      "level": "володіння",
      "title": "алфавіт"
    }
  },
  "portfolio": {
    "html": {
      "title": "Довідник HTML на React",
      "short": "Додаток на React",
      "description": "Інтерактивний довідник HTML тегов на React/Redux. Фільтрація, пошук, рухоме меню с вказівником. Проект готувався 5 дніві з використанням збірки create-react-app."
    },
    "magnat-lzr":{
      "title": "Магазин навушників Magnat",
      "short": "Односторінковий сайт з нуля",
      "description": "Кастомний HTML5 Video плеєр на головній, адаптивний дизайн с підтримкою на мобільних пристроях. Модульна структура JS скрипту."
    },
    "pizza":{
      "title": "Додаток 'Піцерія'",
      "short": "Односторінковий сайт на Angular",
      "description": "Учбовий проект на Angular 2 (angular-cli). На сайту реалізован онлайн-магазин пици, сбір з інгредієнтів та додавання у кошик. Всі дані зберігаються у localStorage."
    },
    "resume":{
      "title": "Інтерактивне резюме",
      "short": "Одностраничное резюме на Angular",
      "description": "Додаток на Angular зі зміною мови, переглядом робот з портфоліо на різних пристроях. Робота виконана на сбірці Webpack, з полученням даних з Firebase, адаптивна верстка."
    },
    "value":{
      "title": "Value Garden Supply",
      "short": "Сторінка піксель в піксель",
      "description": "Кроссбраузерна верстка сторінки за JPG макетом. Реализація адаптивності на мій розсуд."
    },
    "naturetour":{
      "title": "Nature Tour сторінка",
      "short": "Сторінка піксель в піксель",
      "description": "Кроссбраузерна верстка сторінки за PSD макетом з реализацією динамічного слайдеру на JavaScript. Адаптивність на мій розсуд. Препроцесор LESS."
    },
    "jokerbros":{
      "title": "Игровий шоурум Jokerbros",
      "short": "Учбовий проект з нуля",
      "description": "Проект с БД випадковим чином вибирає ігрока-переможця, якому нараховується ставка усіх учасників гры. БД фільтри ігрових столів, списання коштів у програвших и додання нового геймруму."
    },
    "weather":{
      "title": "Прогноз погоди від Yahoo",
      "short": "Учбовий додаток на React",
      "description": "Додаток прогнозу погоди по містах світу. Використовувалась Yahoo Weather Api, а також різноманітні плагіны React. Відображення прогнозу погоди на тиждень вперед для кожного міста."
    },
    "shoop":{
      "title": "Інтернет-магазин",
      "short": "Дипломний проект під замовлення",
      "description": "Проект інтернет магазину із самопісною CMS. Категорії, товари, додання у кошик, зміна кількості товарів у кошику, авторизація. Є адмін-панель для керування товарами та категоріями."
    },
    "neews":{
      "title": "Новинний портал",
      "short": "Учбовий проект з нуля",
      "description": "Новинний портал реалізований на PHP и БД MySQL. Розподілення новин на категорії, дні та журнали. Додавання статей через адмінку, права користувачів на додавання та розміщення."
    },
    "mmedia":{
      "title": "Сайт відео-студії",
      "short": "Сайт на шаблоні HTML5/JS",
      "description": "Адаптація HTML5 шаблону під потреби компанії по виробництву відео реклами. Впровадження відеофона, зміна скрипту, додання можливості розміщення відео з Youtube."
    },
    "icharger":{
      "title": "Односторінник iCharger",
      "short": "Односторінковий сайт за день",
      "description": "Верстка односторінкового сайту з нуля за день. Вимоги – мінімальний функціонал, максимальна швидкість. Підключення партнерки та плагіну прокрутки."
    },
    "seo20min":{
      "title": "SEO за 20 хвилин",
      "short": "Сторінка піксель в піксель",
      "description": "Тренувальний проект. Кроссбраузерна верстка сторінки 'піксель в піксель' за JPG макетом."
    },
    "cloudnews":{
      "title": "Cloudnews",
      "short": "Сторінка піксель в піксель",
      "description": "Сторінка новинного порталу за PSD макетом с реализацією дизайну піксель в піксель. Використання SASS та додатків к Chrome - 'PerfectPixel' и 'Pix to Pix'"
    },
    "po-sekretu":{
      "title": "Блог 'По секрету'",
      "short": "Сайт на Wordpress",
      "description": "Адаптація Wordpress шаблону під блог замовника. Нарощування функционалу за допоомгою плагінів, зміна дизайну, добання можливостей через зміну PHP скриптів. Розміщення та підтримка сайту."
    }
  },
  "interests": {
    "code": "В даний час моє головне захоплення – це кодити",
    "book": "В вільний час можу прочитати одну-дві книги відомих авторів",
    "music": "Музика - незамінний супутник. В моєму mp3 плеєру завжди знайдется потрібний трек",
    "games": "Такі ігри як УНО, Аліас, Монополія, Мафія - це відмінний привід зустрітися з друзями та весело провести час",
    "bike": "Велосипед для мене це спосіб активно провести дозвілля, особливо в компанії друзів на довгих поїздках",
    "snowboard": "Сноуборд – моє екстремальне захоплення №1. Нажаль тільки зима не цілий рік",
    "windsurf": "Віндсерфінг – це захоплення юності, а також один з видів спорту, в якому я досяг успіху",
    "kite": "Кайт – це свобода на морських хвилях. Під час поїздки на море обов'язково виходжу в море з кайтом",
    "tennis": "Теніс – захоплення дитинства, яке переросло в дещо більше. Перед інститутом вам розряд КМС, сьогодні просто любитель",
    "smoke": "Не курю, что також допомогає мені відчувати себе добре",
    "alcohol": "Алкоголь не вживаю",
    "drug": "Не вживаю ніяких наркотиків",
    "cgames": "Намагаюсь не витрачати свій вільний час на компьютерні ігри",
    "angry": "Не схильний к незадоволенню, буркотливості та агрессії"
  },
  "qualities": {
    "fast-start": {
      "title": "Швидкий старт",
      "description": "Понурююсь у проект протягом 1-2 днів, вмію швидко налаштувати своє оточення для початку роботи, та розібратись в чужому коді"
    },
    "team-player": {
      "title": "Командний гравець",
      "description": "Неодноразово зустрічав повне взаєморозуміння з боку учасників проекту, з якими мені доводилося працювати. Ніколи не конфліктую з колегами, а навпаки намагаюся підтримати позитивну атмосферу"
    },
    "clear-code": {
      "title": "Чистюля",
      "description": "В результаті рефакторінга великої кількості коду зрозумів, що код потрібно писати чистим і зрозумілим для інших розробників - тому в моїй роботі намагаюся дотримуватися цього правила і вдосконалюватися в цьому напрямку"
    },
    "diligent": {
      "title": "На совість",
      "description": "Чесність і сумлінність - це якості, яким дотримуюся в будь-якій ситуації"
    },
    "energetic": {
      "title": "Енергійний",
      "description": "Всі мої колеги на попередні місця роботи були раді працювати зі мною в одному проекті завдяки моїй енергійності і позитиву. Це якість також дозволяє мені швидко справлятися зі своєю роботою"
    },
    "communicate": {
      "title": "Люблю поспілкуватися",
      "description": "Уміння спілкуватися з людьми - це життєво важливий навик для програміста, тому я не втрачаю можливості поспілкуватися з колегами, як по роботі, так і поза нею"
    },
    "quick-learn": {
      "title": "Швидко вчусь",
      "description": "Швидко засвоюю нову інформацію і вмію в найкоротші терміни почати користуватися незнайомим плагіном або технологією"
    },
    "productivity": {
      "title": "Спринтер",
      "description": "На минулих місцях праці мене цінували за швидковиконану роботу"
    }
  },
  "service": {
    "back-to-portfolio": "Повернутись до прикладів робіт",
    "go-to-work-site": "Перейти до сайту",
    "filter-tip": "Показати роботи із застосуванням ",
    "layout": "Переглянути макет"
  }
}